00-foundations/mixture-of-experts/moe-lab/moelab/fixtures/bench_serve_olmoe_2xT4_dp_ep_c1.txt
# sample output in the documented format (illustrative): generated by tools/make_fixtures.py from moelab's own models; not captured from a real model or GPU
# vllm bench serve --base-url http://127.0.0.1:8000 --model allenai/OLMoE-1B-7B-0924-Instruct --dataset-name random --random-input-len 256 --random-output-len 128 --num-prompts 16 --max-concurrency 1 --ignore-eos
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  22.57     
Total input tokens:                      4096      
Total generated tokens:                  2048      
Request throughput (req/s):              0.71      
Output token throughput (tok/s):         90.74     
Peak output token throughput (tok/s):    95.38     
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          272.23    
---------------Time to First Token----------------
Mean TTFT (ms):                          33.55     
Median TTFT (ms):                        32.54     
P99 TTFT (ms):                           63.74     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          10.62     
Median TPOT (ms):                        10.31     
P99 TPOT (ms):                           14.34     
---------------Inter-token Latency----------------
Mean ITL (ms):                           10.48     
Median ITL (ms):                         10.38     
P99 ITL (ms):                            14.15     
==================================================