00-foundations/mixture-of-experts/moe-lab/moelab/fixtures/bench_serve_olmoe_2xT4_dp_ep_c1.txt
# sample output in the documented format (illustrative): generated by tools/make_fixtures.py from moelab's own models; not captured from a real model or GPU
# vllm bench serve --base-url http://127.0.0.1:8000 --model allenai/OLMoE-1B-7B-0924-Instruct --dataset-name random --random-input-len 256 --random-output-len 128 --num-prompts 16 --max-concurrency 1 --ignore-eos
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  24.32     
Total input tokens:                      4096      
Total generated tokens:                  2048      
Request throughput (req/s):              0.66      
Output token throughput (tok/s):         84.21     
Peak output token throughput (tok/s):    88.51     
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          252.62    
---------------Time to First Token----------------
Mean TTFT (ms):                          36.15     
Median TTFT (ms):                        35.07     
P99 TTFT (ms):                           68.69     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.45     
Median TPOT (ms):                        11.11     
P99 TPOT (ms):                           15.46     
---------------Inter-token Latency----------------
Mean ITL (ms):                           11.30     
Median ITL (ms):                         11.19     
P99 ITL (ms):                            15.25     
==================================================