00-foundations/mixture-of-experts/moe-lab/moelab/fixtures/bench_serve_olmoe_2xT4_dp_ep_c16.txt
# sample output in the documented format (illustrative): generated by tools/make_fixtures.py from moelab's own models; not captured from a real model or GPU
# vllm bench serve --base-url http://127.0.0.1:8000 --model allenai/OLMoE-1B-7B-0924-Instruct --dataset-name random --random-input-len 256 --random-output-len 128 --num-prompts 128 --max-concurrency 16 --ignore-eos
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  36.41     
Total input tokens:                      32768     
Total generated tokens:                  16384     
Request throughput (req/s):              3.52      
Output token throughput (tok/s):         450.04    
Peak output token throughput (tok/s):    489.31    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          1350.13   
---------------Time to First Token----------------
Mean TTFT (ms):                          202.74    
Median TTFT (ms):                        196.65    
P99 TTFT (ms):                           385.20    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.53     
Median TPOT (ms):                        32.53     
P99 TPOT (ms):                           45.27     
---------------Inter-token Latency----------------
Mean ITL (ms):                           32.70     
Median ITL (ms):                         32.37     
P99 ITL (ms):                            44.14     
==================================================