00-foundations/mixture-of-experts/moe-lab/moelab/fixtures/bench_serve_olmoe_2xT4_tp_c16.txt
# sample output in the documented format (illustrative): generated by tools/make_fixtures.py from moelab's own models; not captured from a real model or GPU
# vllm bench serve --base-url http://127.0.0.1:8000 --model allenai/OLMoE-1B-7B-0924-Instruct --dataset-name random --random-input-len 256 --random-output-len 128 --num-prompts 128 --max-concurrency 16 --ignore-eos
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  35.32     
Total input tokens:                      32768     
Total generated tokens:                  16384     
Request throughput (req/s):              3.62      
Output token throughput (tok/s):         463.93    
Peak output token throughput (tok/s):    505.33    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          1391.80   
---------------Time to First Token----------------
Mean TTFT (ms):                          196.31    
Median TTFT (ms):                        190.42    
P99 TTFT (ms):                           372.98    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          32.53     
Median TPOT (ms):                        31.56     
P99 TPOT (ms):                           43.92     
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.66     
Median ITL (ms):                         31.35     
P99 ITL (ms):                            42.74     
==================================================