00-foundations/mixture-of-experts/moe-lab/moelab/fixtures/bench_serve_olmoe_2xT4_tp_ep_c1.txt
# sample output in the documented format (illustrative): generated by tools/make_fixtures.py from moelab's own models; not captured from a real model or GPU
# vllm bench serve --base-url http://127.0.0.1:8000 --model allenai/OLMoE-1B-7B-0924-Instruct --dataset-name random --random-input-len 256 --random-output-len 128 --num-prompts 16 --max-concurrency 1 --ignore-eos
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  19.70     
Total input tokens:                      4096      
Total generated tokens:                  2048      
Request throughput (req/s):              0.81      
Output token throughput (tok/s):         103.98    
Peak output token throughput (tok/s):    110.30    
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          311.93    
---------------Time to First Token----------------
Mean TTFT (ms):                          29.01     
Median TTFT (ms):                        28.14     
P99 TTFT (ms):                           55.12     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.27      
Median TPOT (ms):                        9.00      
P99 TPOT (ms):                           12.52     
---------------Inter-token Latency----------------
Mean ITL (ms):                           9.07      
Median ITL (ms):                         8.98      
P99 ITL (ms):                            12.24     
==================================================