00-foundations/mixture-of-experts/moe-lab/moelab/fixtures/bench_serve_olmoe_2xT4_tp_ep_c1.txt
# sample output in the documented format (illustrative): generated by tools/make_fixtures.py from moelab's own models; not captured from a real model or GPU
# vllm bench serve --base-url http://127.0.0.1:8000 --model allenai/OLMoE-1B-7B-0924-Instruct --dataset-name random --random-input-len 256 --random-output-len 128 --num-prompts 16 --max-concurrency 1 --ignore-eos
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  21.13     
Total input tokens:                      4096      
Total generated tokens:                  2048      
Request throughput (req/s):              0.76      
Output token throughput (tok/s):         96.93     
Peak output token throughput (tok/s):    102.82    
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          290.79    
---------------Time to First Token----------------
Mean TTFT (ms):                          31.12     
Median TTFT (ms):                        30.19     
P99 TTFT (ms):                           59.13     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.95      
Median TPOT (ms):                        9.65      
P99 TPOT (ms):                           13.43     
---------------Inter-token Latency----------------
Mean ITL (ms):                           9.73      
Median ITL (ms):                         9.63      
P99 ITL (ms):                            13.13     
==================================================