00-foundations/mixture-of-experts/moe-lab/moelab/fixtures/bench_serve_olmoe_2xT4_tp_ep_c16.txt
# sample output in the documented format (illustrative): generated by tools/make_fixtures.py from moelab's own models; not captured from a real model or GPU
# vllm bench serve --base-url http://127.0.0.1:8000 --model allenai/OLMoE-1B-7B-0924-Instruct --dataset-name random --random-input-len 256 --random-output-len 128 --num-prompts 128 --max-concurrency 16 --ignore-eos
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  35.31     
Total input tokens:                      32768     
Total generated tokens:                  16384     
Request throughput (req/s):              3.63      
Output token throughput (tok/s):         464.01    
Peak output token throughput (tok/s):    499.47    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          1392.04   
---------------Time to First Token----------------
Mean TTFT (ms):                          198.61    
Median TTFT (ms):                        192.65    
P99 TTFT (ms):                           377.36    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          32.51     
Median TPOT (ms):                        31.53     
P99 TPOT (ms):                           43.89     
---------------Inter-token Latency----------------
Mean ITL (ms):                           32.03     
Median ITL (ms):                         31.71     
P99 ITL (ms):                            43.25     
==================================================